app/controllers/expenses_controller.rb

  def index
    @types = ["academic","food","rent","personal","books","health"]
    @expense = Expense.new
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def create
    @expense = Expense.new(expense_params)

    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("desc", "amount", "expense_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["desc", "Health Insurance"], ["amount", 1461], ["expense_type", "Health Insurance"], ["created_at", "2017-08-26 18:58:06.077756"], ["updated_at", "2017-08-26 18:58:06.077756"]]

  def update
    respond_to do |format|
      if @expense.update(expense_params)
---
UPDATE "expenses" SET "expense_type" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["expense_type", "Academic"], ["updated_at", "2017-08-26 18:57:45.310412"], ["id", 1]]

  def destroy
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 7]]

    def set_expense
      @expense = Expense.find(params[:id])
---
SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 7]]